# 27-05-2024

In [ ]:
========== EDA (exploratory data analysis) ================
1) pandas : data frame applications

2) numpy : numerical python all math applications

3) mathplotlib : used for plot

4) seaborn : used for plot

5) plotly : used for plot

6) bokhe : plot

================= Machine Learning =============
7) sickit-learn: sklearn

================= Deep Learning ================
8) tensorflow : google(developed by)

9) keras : google(developed by)

10) pytorch : facebook(developed by)

================= NLP =================
11) NLTK : NAtural Language tool Kit

12) scipy

================= BERT =================
13) Transformers : Hugging face(google)

================= Google models =================
14) specific google packages

================= Azure ML =================
15) Azure packages

================= Gen AI =================
16) Gemini Ai : google
17) chatgpt: openAI

================= Langchain =================
18) Langchain packages

**$# step-1$**
**create a dataframe using list**

In [ ]:
- list===dictionary
- dictionary===list

In [1]:
import pandas as pd
names=['amar','akbhar','antony']
pd.DataFrame() #empty dataframe will be created no rows no colomns

Empty DataFrame
Columns: []
Index: []

**$ #step-2$**
**provide the data**

In [2]:
names=['amar','akbhar','antony']
pd.DataFrame(names)

        0
0    amar
1  akbhar
2  antony

In [3]:
names=['amar','akbhar','antony']
age=[20,25,27]
pd.DataFrame(names,age)

         0
20    amar
25  akbhar
27  antony

In [4]:
names=['amar','akbhar','antony']
age=[20,25,27]
pd.DataFrame(zip(names,age))
# what is the first potenstial argument: data
# what is the second potential argument: index

        0   1
0    amar  20
1  akbhar  25
2  antony  27

In [7]:
names=['amar','akbhar','antony']
age=[20,25,27]
city=['hyd','blr','chennai']
data=(zip(names,age))
pd.DataFrame(data,city)

              0   1
hyd        amar  20
blr      akbhar  25
chennai  antony  27

**$ #step-3$**
**provide colomn names**

In [10]:
names=['amar','akbhar','antony']
age=[20,25,27]
pd.DataFrame(zip(names,age),
             columns=['names','age'])

    names  age
0    amar   20
1  akbhar   25
2  antony   27

In [11]:
names=['amar','akbhar','antony']
age=[20,25,27]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city),
             columns=['names','age','city'])

    names  age     city
0    amar   20      hyd
1  akbhar   25      blr
2  antony   27  chennai

In [14]:
names=['amar','akbhar','antony']
age=[20,25,27]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['names','age','city']
pd.DataFrame(data,columns=cols)

    names  age     city
0    amar   20      hyd
1  akbhar   25      blr
2  antony   27  chennai

In [15]:
names=['amar','akbhar','antony']
age=[20,25,27]
city=['hyd','blr','chennai']
salary =[500,1000,1500]

data=zip(names,age,city,salary)
cols=['names','age','city',salary]
pd.DataFrame(data,columns=cols)

TypeError: unhashable type: 'list'

TypeError: unhashable type: 'list'

In [16]:
names=['amar','akbhar','antony']
age=[20,25,27]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['names','age','city']
df=pd.DataFrame(data,columns=cols)

In [17]:
type(df)

pandas.core.frame.DataFrame

**$ #step-4$ ADD new coloum**

- if you want to add a new column 
- first you need to check the number of rows in already existed data
- for example in above the dataframe has 3 rows
- you need to create a new list with 3 rows
- that list eqauate to the dataframe

In [30]:
salary =[5000,10000,15000]
df['salary']=salary
df

    names  age     city  salary
a    amar   20      hyd    5000
b  akbhar   25      blr   10000
c  antony   27  chennai   15000

In [31]:
job =['ds','de','cs']
df['job']=job
df

    names  age     city  salary job
a    amar   20      hyd    5000  ds
b  akbhar   25      blr   10000  de
c  antony   27  chennai   15000  cs

**$ #step-5$ update or modify already existed colmn values**

In [32]:
salary =[10000,20000,15000]
df['salary']=salary
df

    names  age     city  salary job
a    amar   20      hyd   10000  ds
b  akbhar   25      blr   20000  de
c  antony   27  chennai   15000  cs

In [22]:
age =[24,26,29]
df['age']=age
df

    names  age     city  salary job
0    amar   24      hyd   10000  ds
1  akbhar   26      blr   20000  de
2  antony   29  chennai   15000  cs

**$ #step-6$  how to change the index**

In [26]:
names=['amar','akbhar','antony']
age=[20,25,27]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['names','age','city']
idx=['a','b','c']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

    names  age     city
a    amar   20      hyd
b  akbhar   25      blr
c  antony   27  chennai

In [ ]:
names=['amar','akbhar','antony']
age=[20,25,27]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['names','age','city']
idx=['a','b','c','d']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

**note:**
- number of list equals to(=) **number of coloumns**
- number of values  inside list equals to(=) **number of rows**
- when you create the data all the list should be in the same length

**$ #step-7$**  **shape**
- number of columns

In [28]:
df.shape
# matrix format
# 4 tows and 3 columns
print("the number of rows are:" ,df.shape[0])
print("the number of columns are:" ,df.shape[1])

the number of rows are: 3
the number of columns are: 3

**$ #step-8$ how to drop the column**

- in oreder t drop the column we require 3 arguments
  
i) column name

 - the column name we need to mention

ii) axis
 - axis=0 ...**represents rows**
   
 - axis=1 ...**represents columns**

iii) inplace
 - we drop column means we are modifying the data frame
 - so this modification we want to save in same variable or different variable
 - if you want to keep in the same variable the **inplace=True**

In [33]:
df.drop('salary',
        axis=1,
        inplace=True)
df

    names  age     city job
a    amar   20      hyd  ds
b  akbhar   25      blr  de
c  antony   27  chennai  cs

In [38]:
df1=df.drop('job',
        axis=1) # do not give implace=True and new variable

In [39]:
df

    names  age     city job
a    amar   20      hyd  ds
b  akbhar   25      blr  de
c  antony   27  chennai  cs

In [40]:
df1 # modified one save into df1

    names  age     city
a    amar   20      hyd
b  akbhar   25      blr
c  antony   27  chennai

In [48]:
Names=['amar','akbhar','antony','alex']
Age=[20,25,27,29]
City=['hyd','blr','chennai','mumbai']

data=zip(Names,Age,City)
cols=['Names','Age','City']
idx=['a','b','c','d']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

    Names  Age     City
a    amar   20      hyd
b  akbhar   25      blr
c  antony   27  chennai
d    alex   29   mumbai

In [49]:
df.drop('City',
        axis=1,
        inplace=True)
df

    Names  Age
a    amar   20
b  akbhar   25
c  antony   27
d    alex   29

**$ #step-9$ how to drop multiple column**

In [50]:
Names=['amar','akbhar','antony','alex']
Age=[20,25,27,29]
City=['hyd','blr','chennai','mumbai']

data=zip(Names,Age,City)
cols=['Names','Age','City']
idx=['a','b','c','d']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

    Names  Age     City
a    amar   20      hyd
b  akbhar   25      blr
c  antony   27  chennai
d    alex   29   mumbai

In [53]:
df.drop(['Age','City'],axis=1,inplace=True)

In [54]:
df

    Names
a    amar
b  akbhar
c  antony
d    alex

**$ #step-10$ how to drop the rows**

In [55]:
Names=['amar','akbhar','antony','alex']
Age=[20,25,27,29]
City=['hyd','blr','chennai','mumbai']

data=zip(Names,Age,City)
cols=['Names','Age','City']
idx=['a','b','c','d']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

    Names  Age     City
a    amar   20      hyd
b  akbhar   25      blr
c  antony   27  chennai
d    alex   29   mumbai

In [56]:
df.drop('d',axis=0,inplace=True)

In [57]:
df

    Names  Age     City
a    amar   20      hyd
b  akbhar   25      blr
c  antony   27  chennai

**$ #step-11$**
**how to save the dataframe**

- generally dataframes are two types
- csv (comma seperated value)
- excel

In [64]:
# file name=data
# extension= .csv
df.to_csv('data1.csv',index=False) #to remove index column

In [63]:
# extension 
# .xlsx
df.to_excel('data2.xlsx',index=False)

# practice session1